IRP/src/Catalogs/PrintFormTemplates/PrintFormTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PrintFormTemplates</name>
 <attributes>
  <name>PrintFormType</name>
  <type>
   <types>EnumRef.PrintFormTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintFormVariableType</name>
  <type>
   <types>EnumRef.PrintFormVariableTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Template</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>UseTables</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UsePrintInformations</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfoPath</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>LimitedAccess</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Tables</name>
  <attributes>
   <name>Name</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>Expression</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>RepeatingArea</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>LineStart</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>LineEnd</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Parameters</name>
  <attributes>
   <name>Name</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>Table</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>Expression</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>ToDelete</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>HideEmpty</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AccessGroups</name>
  <attributes>
   <name>Group</name>
   <type>
    <types>CatalogRef.AccessGroups</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PrintFormTemplates/Forms/FormulaEditingTable/Module.bsl
// @strict-types

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Title = Parameters.Name;
	
	FormulaText = Parameters.Expression;
	If IsBlankString(FormulaText) Then
		FormulaText = "Result = Source.<Table>;";
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure Save(Command)
	Notify("FormulaIsReady", FormulaText);
	Close();
EndProcedure

&AtClient
Procedure Test(Command)
	TestOnServer();
EndProcedure

&AtClient
Procedure InsertResult(Command)
	AddTextToFormula("Result");
EndProcedure

&AtClient
Procedure InsertSource(Command)
	AddTextToFormula("Source");
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure TestOnServer()
	TableResult = Catalogs.PrintFormTemplates.GetTableValue(FormulaText, Source);
	Try
		Result = StrTemplate(R().I_4, Format(TableResult.Count(), "NZ=; NG=;"));
	Except
		Result = R().I_5;
	EndTry;
EndProcedure

&AtClient
Procedure AddTextToFormula(NewText) 

	PrevPosition = StrLen(FormulaText) + 1;
	FormulaText = FormulaText + NewText;
	NewPosition = PrevPosition + StrLen(NewText);
	
	ThisObject.RefreshDataRepresentation(Items.FormulaText);
	ThisObject.CurrentItem = Items.FormulaText;
	Items.FormulaText.SetTextSelectionBounds(PrevPosition, NewPosition);
	
EndProcedure

#EndRegion
